Repository: SeanCSLegion/JustADiary
Catalog: JustDiary/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# a11y_back
source: Back
zh_hans: 返回

# a11y_insert_image
source: Insert image
zh_hans: 插入图片

# a11y_map_level
source: Map level
zh_hans: 地图层级

# a11y_map_zoom
source: Map zoom
zh_hans: 地图缩放

# a11y_next_day
source: Next day
zh_hans: 后一天

# a11y_prev_day
source: Previous day
zh_hans: 前一天

# a11y_share
source: Share
zh_hans: 分享

source: Cancel
zh_hans: 取消

source: Continue
zh_hans: 继续

source: Delete
zh_hans: 删除

source: Discard
zh_hans: 放弃

# editor_cross_day_msg
source: This content will be saved to %@. It will be archived after you save and exit.
zh_hans: 本次内容将保存为 %@ 的日记。保存并退出后，这篇日记将归档。

# editor_cross_day_title
source: Crossing day boundary
zh_hans: 跨日编辑提示

# editor_delete_count
source: Delete (%d)
zh_hans: 删除(%d)

# editor_delete_msg
source: Delete the selected %d blocks? This cannot be undone.
zh_hans: 将删除选中的 %d 个编辑块，删除后不可恢复。

# editor_delete_title
source: Delete blocks
zh_hans: 删除编辑块

# editor_edit_target_msg
source: Unsaved changes will be discarded if you switch.
zh_hans: 当前有未保存的修改，切换后将被放弃。

# editor_edit_target_title
source: Switch target
zh_hans: 切换编辑目标

# editor_editing
source: Editing
zh_hans: 编辑中

# editor_exit_block_msg
source: Changes to this block are not saved.
zh_hans: 对该编辑块的修改尚未保存。

# editor_exit_content_msg
source: You have unsaved content.
zh_hans: 内容尚未保存，退出前需要处理。

# editor_exit_title
source: Leave editor
zh_hans: 退出编辑

# editor_font_body
source: Body
zh_hans: 正文

# editor_font_heading
source: Heading
zh_hans: 大标题

# editor_font_sub
source: Subheading
zh_hans: 小标题

# editor_history_no_add_msg
source: Past entries can only be edited in place. Adding new blocks is disabled to keep timestamps consistent.
zh_hans: 历史日记只能修改原有编辑块，不能新增内容，以免时间线错乱。

# editor_history_no_add_title
source: Cannot add blocks
zh_hans: 无法新增编辑块

# editor_image_failed_msg
source: Couldn't load this image. Please try another one.
zh_hans: 无法读取这张图片，请换一张重试。

# editor_image_failed_title
source: Insert image failed
zh_hans: 插入图片失败

# editor_keep_editing
source: Keep editing
zh_hans: 继续编辑

# editor_location_fetching
source: Locating…
zh_hans: 位置获取中…

# editor_location_permission_manage
source: Manage location permission
zh_hans: 管理定位权限

# editor_location_retry
source: Location unavailable
zh_hans: 未获取到位置

# editor_location_retry_action
source: Retry location
zh_hans: 重新获取位置

# editor_placeholder_edit
source: Edit this block…
zh_hans: 修改这段内容…

# editor_placeholder_new
source: Start writing your thoughts…
zh_hans: 开始记录这一刻的想法…

# editor_readonly_msg
source: Enable “Edit past entries” to modify existing content.
zh_hans: 开启「允许补写 / 修改历史日记」后，可修改已有内容。

# editor_readonly_title
source: Read-only content
zh_hans: 只读内容

# editor_redo
source: Redo
zh_hans: 重做

# editor_save_exit
source: Save & exit
zh_hans: 保存并退出

# editor_save_failed_msg
source: Couldn't save your entry. Please try again.
zh_hans: 日记保存失败，请稍后重试。

# editor_save_failed_title
source: Save failed
zh_hans: 保存失败

# editor_title_edit_block
source: %@ · Edit block
zh_hans: %@ · 编辑块

# editor_tool_bold
source: Bold
zh_hans: 粗体

# editor_tool_center
source: Center
zh_hans: 居中

# editor_tool_heading
source: Heading
zh_hans: 标题

# editor_tool_italic
source: Italic
zh_hans: 斜体

# editor_tool_list
source: List
zh_hans: 列表

# editor_tool_quote
source: Quote
zh_hans: 引用

# editor_tool_strike
source: Strike
zh_hans: 删除线

# editor_tool_todo
source: To-do
zh_hans: 待办

# editor_tool_underline
source: Underline
zh_hans: 下划线

source: Enable
zh_hans: 去开启

# index_card_today
source: Today
zh_hans: 今日

# index_day_empty
source: No entry for this day.
zh_hans: 这一天没有留下日记。

# index_days_ago
source: %1$ld days ago
zh_hans: %1$ld天前

# index_days_later
source: in %1$ld days
zh_hans: %1$ld天后

# index_future_empty
source: This day hasn't arrived yet.
zh_hans: 这一天还没有到来。

# index_future_toast
source: You can't write a diary for a future date.
zh_hans: 无法为未来的日期写日记。

# index_title
source: Diary
zh_hans: 日记

# index_today
source: Today
zh_hans: 今天

# index_week_title
source: %1$@ · Week %2$ld
zh_hans: %1$@ 第%2$ld周

# index_write
source: Write
zh_hans: 写日记

# index_written
source: Written
zh_hans: 已记录

# later
source: Not now
zh_hans: 暂不

# loc_precision_city
source: City
zh_hans: 城市

# loc_precision_district
source: District
zh_hans: 区县

# loc_precision_exact
source: Exact place
zh_hans: 精确地点

# loc_precision_province
source: Province
zh_hans: 省份

# loc_precision_street
source: Street
zh_hans: 街道

# map_error_msg
source: Check your network or map service config and retry
zh_hans: 请检查网络连接与地图服务配置后重试

# map_error_title
source: Map service unavailable
zh_hans: 地图服务不可用

# map_level_global
source: World
zh_hans: 全球

# map_level_national
source: China
zh_hans: 全国

# map_level_province
source: Province
zh_hans: 全省

# map_loc_failed
source: Cannot get current location
zh_hans: 无法获取当前位置

# map_open_diary
source: Open
zh_hans: 打开日记

# map_retry
source: Retry
zh_hans: 重试

# map_stat_blocks
source: Blocks
zh_hans: 片段

# map_stat_cities
source: Cities
zh_hans: 城市

# map_stat_countries
source: Countries
zh_hans: 国家

# map_stat_days
source: Days
zh_hans: 天数

# map_stat_provinces
source: Provinces
zh_hans: 省市

# map_summary
source: Located %1$ld · Unlocated %2$ld
zh_hans: 已标注 %1$ld 处 · 未记录 %2$ld 篇

# map_time_all
source: All
zh_hans: 全部

# map_time_apply
source: Apply
zh_hans: 应用

# map_time_clear
source: Clear
zh_hans: 清除

# map_time_custom
source: Custom
zh_hans: 自定义

# map_time_filter
source: Time Filter
zh_hans: 时间筛选

# map_time_month
source: Month
zh_hans: 月份

# map_title
source: Map
zh_hans: 地图

# month_apr
source: Apr
zh_hans: 4月

# month_aug
source: Aug
zh_hans: 8月

# month_dec
source: Dec
zh_hans: 12月

# month_feb
source: Feb
zh_hans: 2月

# month_jan
source: Jan
zh_hans: 1月

# month_jul
source: Jul
zh_hans: 7月

# month_jun
source: Jun
zh_hans: 6月

# month_mar
source: Mar
zh_hans: 3月

# month_may
source: May
zh_hans: 5月

# month_nov
source: Nov
zh_hans: 11月

# month_oct
source: Oct
zh_hans: 10月

# month_sep
source: Sep
zh_hans: 9月

source: OK
zh_hans: 知道了

# read_day_empty
source: No entry for this day.
zh_hans: 这一天没有留下日记。

# read_hero_segments
source: %1$ld moments
zh_hans: %1$ld 个片段

# read_search_placeholder
source: Search this entry…
zh_hans: 在当前日记中查找…

# read_share_failed_msg
source: Couldn't generate the image. Please try again later.
zh_hans: 日记图片生成失败，请稍后重试。

# read_share_failed_title
source: Share failed
zh_hans: 分享失败

# read_start_loc
source: Started in %@
zh_hans: 于%@开始写

# read_start_time
source: Started at %@
zh_hans: %@ 开始写

# read_start_time_loc
source: Started at %@ in %@
zh_hans: %@ · 于%@开始写

# reminder_content
source: You haven't written today — take a few minutes to record it.
zh_hans: 今天还没有写日记，花几分钟记录一下吧

# reminder_title
source: Journal reminder
zh_hans: 写日记提醒

source: Save
zh_hans: 保存

# search_7d
source: Last 7 days
zh_hans: 近 7 天

# search_30d
source: Last 30 days
zh_hans: 近 30 天

# search_all_loc
source: All places
zh_hans: 全部地点

# search_all_time
source: All time
zh_hans: 全部时间

# search_cancel
source: Cancel
zh_hans: 取消

# search_custom
source: Custom…
zh_hans: 自定义…

# search_empty
source: Type a keyword or filter by time and place
zh_hans: 输入关键词，或选择时间与地点筛选

# search_filter_loc
source: Place
zh_hans: 地点

# search_filter_time
source: Time range
zh_hans: 时间范围

# search_load_more
source: Load more
zh_hans: 加载更多

# search_loading
source: Searching…
zh_hans: 正在搜索…

# search_loc_country_only
source: Country only
zh_hans: 仅国家

# search_loc_empty
source: No location data yet
zh_hans: 暂无地点数据

# search_loc_no_loc
source: No place recorded
zh_hans: 未记录地点

# search_loc_picker
source: Pick a place…
zh_hans: 选择地点…

# search_loc_search
source: Search places…
zh_hans: 搜索地点…

# search_loc_sort_hint
source: Sorted by entries count
zh_hans: 按日记数量排序

# search_loc_title
source: Choose a location
zh_hans: 选择地点

# search_no_result
source: No matching entries
zh_hans: 没有找到匹配的日记

# search_no_result_hint
source: Try different keywords or filters
zh_hans: 换个关键词或调整筛选条件试试

# search_placeholder
source: Search diary content…
zh_hans: 搜索日记内容…

# search_preparing
source: Preparing search index…
zh_hans: 正在准备搜索索引…

# search_result_count
source: %d entries found
zh_hans: 找到 %d 条日记

# search_time_apply
source: Apply
zh_hans: 确定

# search_time_clear
source: Clear
zh_hans: 清除

# search_time_end
source: End date
zh_hans: 结束日期

# search_time_month
source: This month
zh_hans: 本月

# search_time_start
source: Start date
zh_hans: 开始日期

# search_time_title
source: Custom time range
zh_hans: 自定义时间范围

# search_time_year
source: This year
zh_hans: 今年

# search_title
source: Search
zh_hans: 搜索

# settings_auto_loc
source: Auto-insert location
zh_hans: 自动插入地点

# settings_auto_loc_sub
source: Requires location permission
zh_hans: 需要位置信息权限

# settings_auto_time
source: Auto-insert time
zh_hans: 自动插入时间

# settings_auto_time_sub
source: Record start time when the editor opens
zh_hans: 打开编辑器时自动记录开始时间

# settings_day_recalc_msg
source: %d entries kept their original date due to the rule change.
zh_hans: 有 %d 篇日记因规则变化保留了原归属日。

# settings_day_recalc_title
source: Recompute dates
zh_hans: 日期重算

# settings_day_start
source: Start of a new day
zh_hans: 新一天的开始时间

# settings_day_start_sub
source: Entries before this time belong to the previous day
zh_hans: 在此时间之前写的内容，归入前一天

# settings_export
source: Export all entries
zh_hans: 导出全部日记

# settings_export_busy
source: Generating backup…
zh_hans: 正在生成备份…

# settings_export_choice_title
source: Export backup
zh_hans: 导出备份

# settings_export_data_only
source: Entries only
zh_hans: 仅日记数据

# settings_export_data_settings
source: Entries + Settings
zh_hans: 日记 + 设置

# settings_export_failed_msg
source: Something went wrong while generating or saving the backup. Please try again.
zh_hans: 生成或保存备份时出错，请重试。

# settings_export_failed_title
source: Export failed
zh_hans: 导出失败

# settings_export_sub
source: Generate a .jdiary backup
zh_hans: 生成 .jdiary 备份包

# settings_history_edit
source: Edit past entries
zh_hans: 允许补写 / 修改历史日记

# settings_history_edit_sub
source: Past entries are read-only when off
zh_hans: 关闭时历史日记只读，空白过去日不可补写

# settings_import
source: Import backup
zh_hans: 导入备份

# settings_import_busy
source: Importing backup…
zh_hans: 正在导入备份…

# settings_import_failed_msg
source: The backup file is invalid or the import failed. Please try again.
zh_hans: 备份文件无效或导入出错，请重试。

# settings_import_failed_title
source: Import failed
zh_hans: 导入失败

# settings_import_mode_title
source: Import mode
zh_hans: 导入方式

# settings_import_overwrite
source: Overwrite existing
zh_hans: 覆盖已有日记

# settings_import_skip
source: Skip existing
zh_hans: 跳过已有日记

# settings_import_sub
source: Restore entries from another device
zh_hans: 从其他设备恢复日记

# settings_import_success_msg
source: Added %d days, skipped %d, overwritten %d (%d blocks, %d images).
zh_hans: 新增 %d 天，跳过 %d 天，覆盖 %d 天（共 %d 个编辑块、%d 张图片）。

# settings_import_success_title
source: Import complete
zh_hans: 导入完成

# settings_lang_system
source: Follow system
zh_hans: 跟随系统

# settings_language
source: Language
zh_hans: 语言

# settings_language_sub
source: Display language of the app
zh_hans: 应用内显示语言

# settings_loc_exact
source: Precise
zh_hans: 精确

# settings_loc_fuzzy
source: Approximate
zh_hans: 模糊

# settings_loc_none
source: Not granted
zh_hans: 未授权

# settings_loc_permission
source: Location permission
zh_hans: 位置权限

# settings_loc_permission_sub
source: Location stays on this device only
zh_hans: 地点仅保存在本机，不会上传

# settings_notif_off
source: Off
zh_hans: 未开启

# settings_notif_on
source: On
zh_hans: 已开启

# settings_notif_permission
source: Notification permission
zh_hans: 通知权限

# settings_notif_permission_sub
source: Reminders won't arrive when off
zh_hans: 关闭后无法收到提醒

# settings_remind_enabled
source: Journal reminder
zh_hans: 写日记提醒

# settings_remind_enabled_sub
source: Remind me when I haven't written today
zh_hans: 当天未写日记时提醒我

# settings_remind_time
source: Reminder time
zh_hans: 提醒时间

# settings_remind_time_sub
source: Once a day
zh_hans: 每天提醒一次

# settings_section_about
source: About
zh_hans: 关于

# settings_section_data
source: Data
zh_hans: 数据

# settings_section_general
source: General
zh_hans: 通用

# settings_section_remind
source: Reminders
zh_hans: 提醒

# settings_section_rules
source: Diary rules
zh_hans: 日记规则

# settings_settings_restored
source: App settings were restored as well.
zh_hans: 已同时恢复应用设置。

# settings_theme
source: Theme
zh_hans: 主题

# settings_theme_dark
source: Dark
zh_hans: 深色

# settings_theme_light
source: Light
zh_hans: 浅色

# settings_theme_sub
source: Light, dark, or follow the system
zh_hans: 切换浅色、深色或跟随系统

# settings_theme_system
source: Follow system
zh_hans: 跟随系统

# settings_title
source: Settings
zh_hans: 设置

# settings_version
source: Version
zh_hans: 版本

# settings_week_monday
source: Monday
zh_hans: 周一

# settings_week_start
source: Start of the week
zh_hans: 一周从哪一天开始

# settings_week_start_sub
source: Choose whether calendars begin on Monday or Sunday
zh_hans: 选择日历从周一开始还是周日开始

# settings_week_sunday
source: Sunday
zh_hans: 周日

# share_image_placeholder
source: Image
zh_hans: 图片

# time_label_afternoon
source: %1$ld:00 PM
zh_hans: 下午 %1$ld:00

# time_label_dawn
source: %1$ld:00 AM
zh_hans: 凌晨 %1$ld:00

# time_label_evening
source: %1$ld:00 PM
zh_hans: 晚上 %1$ld:00

# time_label_midnight
source: 12:00 AM
zh_hans: 凌晨 0:00

# time_label_morning
source: %1$ld:00 AM
zh_hans: 上午 %1$ld:00

# time_label_noon
source: 12:00 PM
zh_hans: 中午 12:00

# week_friday
source: Fri
zh_hans: 周五

# week_monday
source: Mon
zh_hans: 周一

# week_saturday
source: Sat
zh_hans: 周六

# week_sunday
source: Sun
zh_hans: 周日

# week_thursday
source: Thu
zh_hans: 周四

# week_tuesday
source: Tue
zh_hans: 周二

# week_wednesday
source: Wed
zh_hans: 周三
